# Import Libraries

In [1]:
import pandas as pd

C:\Users\mazen\anaconda3\envs\Safty\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

# Data Import and Clean

## The Daily Data

### Gold Prices

In [5]:
gold = pd.read_csv("gold.csv" , usecols = ["Date" , "Adj Close"])

In [6]:
gold.head()

         Date  Adj Close
0  2024-11-29     2649.0
1  2024-11-28     2639.7
2  2024-11-27     2639.9
3  2024-11-26     2620.3
4  2024-11-25     2616.8

In [7]:
gold.shape

(6086, 2)

In [6]:
gold.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       87 non-null     object
 1   Adj Close  87 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.5+ KB

#### Correct Date Format

In [8]:
gold["Date"] = pd.to_datetime(gold["Date"] , format = '%Y-%m-%d')

In [9]:
gold.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6086 entries, 0 to 6085
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       6086 non-null   datetime64[ns]
 1   Adj Close  6086 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 95.2 KB

In [10]:
gold.head()

        Date  Adj Close
0 2024-11-29     2649.0
1 2024-11-28     2639.7
2 2024-11-27     2639.9
3 2024-11-26     2620.3
4 2024-11-25     2616.8

### Column Rename

In [11]:
gold = gold.rename(columns = {"Adj Close" : "Gold"})

In [12]:
gold.head()

        Date    Gold
0 2024-11-29  2649.0
1 2024-11-28  2639.7
2 2024-11-27  2639.9
3 2024-11-26  2620.3
4 2024-11-25  2616.8

### Set Date Index

In [13]:
gold = gold.set_index("Date")

In [14]:
gold.head(20)

              Gold
Date
2024-11-29  2649.0
2024-11-28  2639.7
2024-11-27  2639.9
2024-11-26  2620.3
2024-11-25  2616.8
2024-11-22  2709.9
2024-11-21  2672.1
2024-11-20  2648.2
2024-11-19  2627.1
2024-11-18  2610.6
2024-11-15  2565.7
2024-11-14  2568.2
2024-11-13  2580.8
2024-11-12  2600.0
2024-11-11  2611.2
2024-11-08  2687.5
2024-11-07  2698.4
2024-11-06  2667.6
2024-11-05  2740.3
2024-11-04  2736.1

### Set Frequency

In [15]:
gold = gold.asfreq('b')

In [16]:
gold.tail(20)

              Gold
Date
2024-11-04  2736.1
2024-11-05  2740.3
2024-11-06  2667.6
2024-11-07  2698.4
2024-11-08  2687.5
2024-11-11  2611.2
2024-11-12  2600.0
2024-11-13  2580.8
2024-11-14  2568.2
2024-11-15  2565.7
2024-11-18  2610.6
2024-11-19  2627.1
2024-11-20  2648.2
2024-11-21  2672.1
2024-11-22  2709.9
2024-11-25  2616.8
2024-11-26  2620.3
2024-11-27  2639.9
2024-11-28  2639.7
2024-11-29  2649.0

In [17]:
gold.isnull().sum()

Gold    242
dtype: int64

### Hundle Nulls

In [18]:
gold["Gold"] = gold["Gold"].fillna(method = "ffill")

C:\Users\mazen\AppData\Local\Temp\ipykernel_27308\1852268167.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  gold["Gold"] = gold["Gold"].fillna(method = "ffill")

In [19]:
gold.head()

             Gold
Date
2000-08-30  273.9
2000-08-31  278.3
2000-09-01  277.0
2000-09-04  277.0
2000-09-05  275.8

In [20]:
gold.isnull().sum()

Gold    0
dtype: int64

In [21]:
gold.shape

(6328, 1)

In [24]:
gold.head(5)

             Gold
Date
2000-08-30  273.9
2000-08-31  278.3
2000-09-01  277.0
2000-09-04  277.0
2000-09-05  275.8

In [25]:
gold.tail(5)

              Gold
Date
2024-11-25  2616.8
2024-11-26  2620.3
2024-11-27  2639.9
2024-11-28  2639.7
2024-11-29  2649.0

In [26]:
gold.to_csv('gold_close.csv')

In [41]:
gold['2025-01-01' : '2025-02-06']

              Gold
Date
2025-01-01  2629.2
2025-01-02  2658.9
2025-01-03  2645.0
2025-01-06  2638.4
2025-01-07  2656.7
2025-01-08  2664.5
2025-01-09  2683.8
2025-01-10  2708.5
2025-01-13  2673.5
2025-01-14  2677.5
2025-01-15  2712.5
2025-01-16  2746.4
2025-01-17  2744.3
2025-01-20  2744.3
2025-01-21  2755.0
2025-01-22  2767.6
2025-01-23  2763.1
2025-01-24  2777.3
2025-01-27  2737.5
2025-01-28  2766.8
2025-01-29  2769.1
2025-01-30  2823.0
2025-01-31  2812.5
2025-02-03  2833.9
2025-02-04  2853.3
2025-02-05  2871.6
2025-02-06  2856.0

In [43]:
gold.tail(5)

              Gold
Date
2025-03-03  2890.2
2025-03-04  2909.6
2025-03-05  2915.3
2025-03-06  2916.6
2025-03-07  2904.7

In [45]:
gold = gold.drop(index = gold.loc['2025-02-03' : '2025-03-07'].index)

In [46]:
gold.tail(5)

              Gold
Date
2025-01-27  2737.5
2025-01-28  2766.8
2025-01-29  2769.1
2025-01-30  2823.0
2025-01-31  2812.5

In [47]:
gold.shape

(66, 1)

### Silver Prices

In [48]:
silver = pd.read_csv("silver_test.csv" , usecols = ["Date" , "Adj Close"])

In [49]:
silver.head()

         Date  Adj Close
0  2025-03-09      33.01
1  2025-03-07      32.55
2  2025-03-06      33.06
3  2025-03-05      32.86
4  2025-03-04      32.11

In [50]:
silver.shape

(88, 2)

In [51]:
silver.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       88 non-null     object
 1   Adj Close  88 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.5+ KB

#### Correct Date Format

In [52]:
silver["Date"] = pd.to_datetime(silver["Date"] , format = '%Y-%m-%d')

In [53]:
silver.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       88 non-null     datetime64[ns]
 1   Adj Close  88 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 1.5 KB

In [54]:
silver.head()

        Date  Adj Close
0 2025-03-09      33.01
1 2025-03-07      32.55
2 2025-03-06      33.06
3 2025-03-05      32.86
4 2025-03-04      32.11

### Column Rename

In [55]:
silver = silver.rename(columns = {"Adj Close" : "Silver"})

In [56]:
silver.head()

        Date  Silver
0 2025-03-09   33.01
1 2025-03-07   32.55
2 2025-03-06   33.06
3 2025-03-05   32.86
4 2025-03-04   32.11

### Set Date Index

In [57]:
silver = silver.set_index("Date")

In [58]:
silver.head()

            Silver
Date
2025-03-09   33.01
2025-03-07   32.55
2025-03-06   33.06
2025-03-05   32.86
2025-03-04   32.11

### Check Duplicates

In [59]:
print(silver.index.duplicated().sum())

0

In [60]:
silver = silver.loc[~silver.index.duplicated(keep='first')]

In [61]:
silver.shape

(88, 1)

### Set Frequency

In [62]:
silver = silver.asfreq('b')

In [63]:
silver.head()

            Silver
Date
2024-11-01   32.54
2024-11-04   32.48
2024-11-05   32.65
2024-11-06   31.22
2024-11-07   31.76

In [64]:
silver.isnull().sum()

Silver    4
dtype: int64

### Hundle Nulls

In [65]:
silver["Silver"] = silver["Silver"].fillna(method = "ffill")

C:\Users\mazen\AppData\Local\Temp\ipykernel_16940\4109681538.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  silver["Silver"] = silver["Silver"].fillna(method = "ffill")

In [66]:
silver.head()

            Silver
Date
2024-11-01   32.54
2024-11-04   32.48
2024-11-05   32.65
2024-11-06   31.22
2024-11-07   31.76

In [67]:
silver.isnull().sum()

Silver    0
dtype: int64

In [68]:
silver.shape

(91, 1)

In [69]:
silver.tail(5)

            Silver
Date
2025-03-03   32.03
2025-03-04   32.11
2025-03-05   32.86
2025-03-06   33.06
2025-03-07   32.55

In [70]:
silver = silver.drop(index = silver.loc['2025-02-03' : '2025-03-07'].index)

In [71]:
silver.tail(5)

            Silver
Date
2025-01-27   30.25
2025-01-28   30.73
2025-01-29   31.24
2025-01-30   32.36
2025-01-31   32.13

In [72]:
silver.shape

(66, 1)

### S&P 500 Prices

In [73]:
sp = pd.read_csv("S&P500_test.csv" , usecols = ["Date" , "Adj Close"])

In [74]:
sp.head()

         Date  Adj Close
0  2025-03-07    5770.20
1  2025-03-06    5738.52
2  2025-03-05    5842.63
3  2025-03-04    5778.15
4  2025-03-03    5849.72

In [75]:
sp.shape

(85, 2)

In [76]:
sp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85 entries, 0 to 84
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       85 non-null     object
 1   Adj Close  85 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.5+ KB

#### Correct Date Format

In [77]:
sp["Date"] = pd.to_datetime(sp["Date"] , format = '%Y-%m-%d')

In [78]:
sp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85 entries, 0 to 84
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       85 non-null     datetime64[ns]
 1   Adj Close  85 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 1.5 KB

In [79]:
sp.head()

        Date  Adj Close
0 2025-03-07    5770.20
1 2025-03-06    5738.52
2 2025-03-05    5842.63
3 2025-03-04    5778.15
4 2025-03-03    5849.72

### Column Rename

In [80]:
sp = sp.rename(columns = {"Adj Close" : "S&P 500"})

In [81]:
sp.head()

        Date  S&P 500
0 2025-03-07  5770.20
1 2025-03-06  5738.52
2 2025-03-05  5842.63
3 2025-03-04  5778.15
4 2025-03-03  5849.72

### Set Date Index

In [82]:
sp = sp.set_index("Date")

In [83]:
sp.head()

            S&P 500
Date
2025-03-07  5770.20
2025-03-06  5738.52
2025-03-05  5842.63
2025-03-04  5778.15
2025-03-03  5849.72

### Set Frequency

In [84]:
sp = sp.asfreq('b')

In [85]:
sp.head()

            S&P 500
Date
2024-11-01  5728.80
2024-11-04  5712.69
2024-11-05  5782.76
2024-11-06  5929.04
2024-11-07  5973.10

In [86]:
sp.isnull().sum()

S&P 500    6
dtype: int64

### Hundle Nulls

In [87]:
sp["S&P 500"] = sp["S&P 500"].fillna(method = "ffill")

C:\Users\mazen\AppData\Local\Temp\ipykernel_16940\1099422429.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  sp["S&P 500"] = sp["S&P 500"].fillna(method = "ffill")

In [88]:
sp.head()

            S&P 500
Date
2024-11-01  5728.80
2024-11-04  5712.69
2024-11-05  5782.76
2024-11-06  5929.04
2024-11-07  5973.10

In [89]:
sp.isnull().sum()

S&P 500    0
dtype: int64

In [90]:
sp.shape

(91, 1)

In [91]:
sp.tail(5)

            S&P 500
Date
2025-03-03  5849.72
2025-03-04  5778.15
2025-03-05  5842.63
2025-03-06  5738.52
2025-03-07  5770.20

In [92]:
sp = sp.drop(index = sp.loc['2025-02-03' : '2025-03-07'].index)

In [93]:
sp.tail(5)

            S&P 500
Date
2025-01-27  6012.28
2025-01-28  6067.70
2025-01-29  6039.31
2025-01-30  6071.17
2025-01-31  6040.53

In [94]:
sp.shape

(66, 1)

### US Dollar Prices

In [95]:
us = pd.read_csv("us_dollar_test.csv" , usecols = ["Date" , "Adj Close"])

In [96]:
us.head()

         Date  Adj Close
0  2025-03-09     103.68
1  2025-03-07     103.84
2  2025-03-06     104.06
3  2025-03-05     105.74
4  2025-03-04     105.74

In [97]:
us.shape

(87, 2)

In [98]:
us.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       87 non-null     object
 1   Adj Close  87 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.5+ KB

#### Correct Date Format

In [99]:
us["Date"] = pd.to_datetime(us["Date"] , format = '%Y-%m-%d')

In [100]:
us.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       87 non-null     datetime64[ns]
 1   Adj Close  87 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 1.5 KB

In [101]:
us.head()

        Date  Adj Close
0 2025-03-09     103.68
1 2025-03-07     103.84
2 2025-03-06     104.06
3 2025-03-05     105.74
4 2025-03-04     105.74

### Column Rename

In [102]:
us = us.rename(columns = {"Adj Close" : "US Dollar"})

In [103]:
us.head()

        Date  US Dollar
0 2025-03-09     103.68
1 2025-03-07     103.84
2 2025-03-06     104.06
3 2025-03-05     105.74
4 2025-03-04     105.74

### Set Date Index

In [104]:
us = us.set_index("Date")

In [105]:
us.head()

            US Dollar
Date
2025-03-09     103.68
2025-03-07     103.84
2025-03-06     104.06
2025-03-05     105.74
2025-03-04     105.74

### Set Frequency

In [106]:
us = us.asfreq('b')

In [107]:
us.head()

            US Dollar
Date
2024-11-01     104.28
2024-11-04     103.89
2024-11-05     103.42
2024-11-06     105.09
2024-11-07     104.51

In [108]:
us.isnull().sum()

US Dollar    5
dtype: int64

### Hundle Nulls

In [109]:
us["US Dollar"] = us["US Dollar"].fillna(method = "ffill")

C:\Users\mazen\AppData\Local\Temp\ipykernel_16940\2042274180.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  us["US Dollar"] = us["US Dollar"].fillna(method = "ffill")

In [110]:
us.head()

            US Dollar
Date
2024-11-01     104.28
2024-11-04     103.89
2024-11-05     103.42
2024-11-06     105.09
2024-11-07     104.51

In [111]:
us.isnull().sum()

US Dollar    0
dtype: int64

In [112]:
us.shape

(91, 1)

In [113]:
us.tail(5)

            US Dollar
Date
2025-03-03     106.75
2025-03-04     105.74
2025-03-05     105.74
2025-03-06     104.06
2025-03-07     103.84

In [114]:
us = us.drop(index = us.loc['2025-02-03' : '2025-03-07'].index)

In [115]:
us.tail(5)

            US Dollar
Date
2025-01-27     107.34
2025-01-28     107.87
2025-01-29     108.00
2025-01-30     107.80
2025-01-31     108.37

In [116]:
us.shape

(66, 1)

### Oil Prices

In [117]:
oil = pd.read_csv("oil_test.csv" , usecols = ["Date" , "Adj Close"])

In [118]:
oil.head()

         Date  Adj Close
0  2025-03-09      66.55
1  2025-03-07      67.04
2  2025-03-06      66.36
3  2025-03-05      66.31
4  2025-03-04      68.26

In [119]:
oil.shape

(88, 2)

In [120]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       88 non-null     object
 1   Adj Close  88 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.5+ KB

#### Correct Date Format

In [121]:
oil["Date"] = pd.to_datetime(oil["Date"] , format = '%Y-%m-%d')

In [122]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       88 non-null     datetime64[ns]
 1   Adj Close  88 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 1.5 KB

In [123]:
oil.head()

        Date  Adj Close
0 2025-03-09      66.55
1 2025-03-07      67.04
2 2025-03-06      66.36
3 2025-03-05      66.31
4 2025-03-04      68.26

### Column Rename

In [124]:
oil = oil.rename(columns = {"Adj Close" : "Oil"})

In [125]:
oil.head()

        Date    Oil
0 2025-03-09  66.55
1 2025-03-07  67.04
2 2025-03-06  66.36
3 2025-03-05  66.31
4 2025-03-04  68.26

### Set Date Index

In [126]:
oil = oil.set_index("Date")

In [127]:
oil.head()

              Oil
Date
2025-03-09  66.55
2025-03-07  67.04
2025-03-06  66.36
2025-03-05  66.31
2025-03-04  68.26

### Set Frequency

In [128]:
oil = oil.asfreq('b')

In [129]:
oil.head()

              Oil
Date
2024-11-01  69.49
2024-11-04  71.47
2024-11-05  71.99
2024-11-06  71.69
2024-11-07  72.36

In [130]:
oil.isnull().sum()

Oil    4
dtype: int64

### Hundle Nulls

In [131]:
oil["Oil"] = oil["Oil"].fillna(method = "ffill")

C:\Users\mazen\AppData\Local\Temp\ipykernel_16940\3892102770.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  oil["Oil"] = oil["Oil"].fillna(method = "ffill")

In [132]:
oil.head()

              Oil
Date
2024-11-01  69.49
2024-11-04  71.47
2024-11-05  71.99
2024-11-06  71.69
2024-11-07  72.36

In [133]:
oil.isnull().sum()

Oil    0
dtype: int64

In [134]:
oil.shape

(91, 1)

In [135]:
oil.tail(5)

              Oil
Date
2025-03-03  68.37
2025-03-04  68.26
2025-03-05  66.31
2025-03-06  66.36
2025-03-07  67.04

In [136]:
oil = oil.drop(index = oil.loc['2025-02-03' : '2025-03-07'].index)

In [137]:
oil.tail(5)

              Oil
Date
2025-01-27  73.17
2025-01-28  73.77
2025-01-29  72.62
2025-01-30  72.73
2025-01-31  72.53

In [138]:
oil.shape

(66, 1)

### Combine In One DataFrame

In [139]:
prices = pd.concat([gold , silver , oil , us , sp] , axis = 'columns')

In [140]:
prices.head()

              Gold  Silver    Oil  US Dollar  S&P 500
Date
2024-11-01  2738.6   32.54  69.49     104.28  5728.80
2024-11-04  2736.1   32.48  71.47     103.89  5712.69
2024-11-05  2740.3   32.65  71.99     103.42  5782.76
2024-11-06  2667.6   31.22  71.69     105.09  5929.04
2024-11-07  2698.4   31.76  72.36     104.51  5973.10

In [141]:
prices.tail()

              Gold  Silver    Oil  US Dollar  S&P 500
Date
2025-01-27  2737.5   30.25  73.17     107.34  6012.28
2025-01-28  2766.8   30.73  73.77     107.87  6067.70
2025-01-29  2769.1   31.24  72.62     108.00  6039.31
2025-01-30  2823.0   32.36  72.73     107.80  6071.17
2025-01-31  2812.5   32.13  72.53     108.37  6040.53

In [142]:
prices.isnull().sum()

Gold         0
Silver       0
Oil          0
US Dollar    0
S&P 500      0
dtype: int64

In [99]:
date_range = pd.date_range(start = '2024-11-01' , end = '2024-12-03' , freq = 'b')

In [100]:
prices = prices.drop(date_range)

In [101]:
prices.tail(30)

              Gold  Silver    Oil  US Dollar  S&P 500
Date
2024-09-20  2619.9   31.18  71.92     100.72  5702.55
2024-09-23  2626.5   30.77  70.37     100.92  5718.57
2024-09-24  2651.2   32.11  71.56     100.37  5732.93
2024-09-25  2659.2   31.70  69.69     100.92  5722.26
2024-09-26  2669.9   32.03  67.67     100.56  5745.37
2024-09-27  2644.3   31.52  68.18     100.42  5738.17
2024-09-30  2636.1   31.16  68.17     100.78  5762.48
2024-10-01  2667.3   31.44  69.83     101.19  5708.75
2024-10-02  2647.1   31.63  70.10     101.68  5709.54
2024-10-03  2657.1   32.19  73.71     101.99  5699.94
2024-10-04  2645.8   32.13  74.38     102.52  5751.07
2024-10-07  2644.8   31.75  77.14     102.54  5695.94
2024-10-08  2615.0   30.35  73.57     102.55  5751.13
2024-10-09  2606.0   30.42  73.24     102.93  5792.04
2024-10-10  2620.6   31.00  75.85     102.99  5780.05
2024-10-11  2657.6   31.52  75.56     102.89  5815.03
2024-10-14  2647.8   31.08  73.83     103.30  5859.85
2024-10-15  2661.4   31.53  70.58     103.26  5815.26
2024-10-16  2674.0   31.76  70.39     103.59  5842.47
2024-10-17  2691.0   31.57  70.67     103.83  5841.47
2024-10-18  2713.7   33.03  69.22     103.49  5864.67
2024-10-21  2723.1   33.87  70.56     104.01  5853.98
2024-10-22  2744.2   34.83  72.09     104.08  5851.20
2024-10-23  2714.4   33.64  70.77     104.43  5797.42
2024-10-24  2734.9   33.61  70.19     104.06  5809.86
2024-10-25  2740.9   33.60  71.78     104.26  5808.12
2024-10-28  2742.9   33.83  67.38     104.32  5823.52
2024-10-29  2768.4   34.27  67.21     104.28  5832.92
2024-10-30  2788.5   33.91  68.61     103.99  5813.67
2024-10-31  2738.3   32.65  69.26     103.98  5705.45

In [143]:
prices.shape

(66, 5)

## The Monthly Data

### Real Interest Data

In [163]:
interest = pd.read_csv("REAINTRATREARAT10Y_test.csv")

In [164]:
interest.head()

  observation_date  REAINTRATREARAT10Y
0       2024-11-01            1.958417
1       2024-12-01            1.824369
2       2025-01-01            2.055532
3       2025-02-01            2.031282

In [165]:
interest = interest.drop(index = 3)

In [166]:
interest.shape

(3, 2)

In [167]:
interest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   observation_date    3 non-null      object
 1   REAINTRATREARAT10Y  3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

#### Correct Date Format

In [168]:
interest["observation_date"] = pd.to_datetime(interest["observation_date"] , format = '%Y-%m-%d')

In [169]:
interest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   observation_date    3 non-null      datetime64[ns]
 1   REAINTRATREARAT10Y  3 non-null      float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 180.0 bytes

In [170]:
interest.head()

  observation_date  REAINTRATREARAT10Y
0       2024-11-01            1.958417
1       2024-12-01            1.824369
2       2025-01-01            2.055532

### Column Rename

In [171]:
interest = interest.rename(columns = {"REAINTRATREARAT10Y" : "Interest" , "observation_date" : "Date"})

In [172]:
interest.head()

        Date  Interest
0 2024-11-01  1.958417
1 2024-12-01  1.824369
2 2025-01-01  2.055532

### Set Date Index

In [173]:
interest = interest.set_index("Date")

In [174]:
interest.head()

            Interest
Date
2024-11-01  1.958417
2024-12-01  1.824369
2025-01-01  2.055532

### Set Frequency

In [175]:
interest = interest.asfreq('d')

In [176]:
interest.head()

            Interest
Date
2024-11-01  1.958417
2024-11-02       NaN
2024-11-03       NaN
2024-11-04       NaN
2024-11-05       NaN

In [177]:
interest.isnull().sum()

Interest    59
dtype: int64

In [178]:
interest.shape

(62, 1)

### Hundle Nulls

In [179]:
interest['Interest'] = interest.groupby(interest.index.to_period('M'))['Interest'].transform('first')

In [180]:
interest.head(5)

            Interest
Date
2024-11-01  1.958417
2024-11-02  1.958417
2024-11-03  1.958417
2024-11-04  1.958417
2024-11-05  1.958417

In [181]:
interest.isnull().sum()

Interest    0
dtype: int64

In [185]:
interest.shape

(62, 1)

In [186]:
interest.tail(5)

            Interest
Date
2024-12-28  1.824369
2024-12-29  1.824369
2024-12-30  1.824369
2024-12-31  1.824369
2025-01-01  2.055532

In [187]:
interest = interest.asfreq('b')

In [188]:
interest.shape

(44, 1)

In [189]:
interest.tail(5)

            Interest
Date
2024-12-26  1.824369
2024-12-27  1.824369
2024-12-30  1.824369
2024-12-31  1.824369
2025-01-01  2.055532

In [190]:
last_date = interest.index[-1]  # 2025-01-01
last_value = interest.iloc[-1]  # آخر قيمة

# إنشاء نطاق تواريخ جديد من آخر تاريخ إلى 2025-01-31
new_dates = pd.date_range(start=last_date + pd.Timedelta(days=1), end="2025-01-31", freq="b")

# إنشاء DataFrame جديد بنفس آخر قيمة
new_df = pd.DataFrame([last_value] * len(new_dates), index=new_dates, columns=interest.columns)

# دمج البيانات الأصلية مع البيانات الجديدة
interest = pd.concat([interest, new_df])

interest.head()

            Interest
2024-11-01  1.958417
2024-11-04  1.958417
2024-11-05  1.958417
2024-11-06  1.958417
2024-11-07  1.958417

In [191]:
interest.tail()

            Interest
2025-01-27  2.055532
2025-01-28  2.055532
2025-01-29  2.055532
2025-01-30  2.055532
2025-01-31  2.055532

In [192]:
interest.shape

(66, 1)

### Correct The ranges

In [126]:
start_date = '2000-08-01'
end_date = '2000-08-29'

In [127]:
interest = interest[~((interest.index >= start_date) & (interest.index <= end_date))]

In [128]:
interest.head()

            Interest
Date
2000-08-30  3.045613
2000-08-31  3.045613
2000-09-01  2.885996
2000-09-04  2.885996
2000-09-05  2.885996

In [220]:
interest.shape

(66, 1)

In [134]:
interest.tail()

            Interest
Date
2025-01-27  2.055532
2025-01-28  2.055532
2025-01-29  2.055532
2025-01-30  2.055532
2025-01-31  2.055532

In [131]:
interest = interest.drop("2024-11-01")

In [132]:
interest.tail()

            Interest
Date
2024-10-25  1.480148
2024-10-28  1.480148
2024-10-29  1.480148
2024-10-30  1.480148
2024-10-31  1.480148

In [133]:
interest.shape

(6307, 1)

### Inflation Data

In [193]:
inflation = pd.read_csv("MEDCPIM158SFRBCLE_test.csv")

In [194]:
inflation.head()

  observation_date  MEDCPIM158SFRBCLE
0       2024-11-01           3.226070
1       2024-12-01           3.234511
2       2025-01-01           3.930193

In [195]:
inflation.shape

(3, 2)

In [196]:
inflation.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   observation_date   3 non-null      object
 1   MEDCPIM158SFRBCLE  3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

#### Correct Date Format

In [197]:
inflation["observation_date"] = pd.to_datetime(inflation["observation_date"] , format = '%Y-%m-%d')

In [198]:
inflation.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   observation_date   3 non-null      datetime64[ns]
 1   MEDCPIM158SFRBCLE  3 non-null      float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 180.0 bytes

In [199]:
inflation.head()

  observation_date  MEDCPIM158SFRBCLE
0       2024-11-01           3.226070
1       2024-12-01           3.234511
2       2025-01-01           3.930193

### Column Rename

In [200]:
inflation = inflation.rename(columns = {"MEDCPIM158SFRBCLE" : "Inflation" , "observation_date" : "Date"})

In [201]:
inflation.head()

        Date  Inflation
0 2024-11-01   3.226070
1 2024-12-01   3.234511
2 2025-01-01   3.930193

### Set Date Index

In [202]:
inflation = inflation.set_index("Date")

In [203]:
inflation.head()

            Inflation
Date
2024-11-01   3.226070
2024-12-01   3.234511
2025-01-01   3.930193

### Set Frequency

In [204]:
inflation = inflation.asfreq('d')

In [205]:
inflation.head()

            Inflation
Date
2024-11-01    3.22607
2024-11-02        NaN
2024-11-03        NaN
2024-11-04        NaN
2024-11-05        NaN

In [206]:
inflation.isnull().sum()

Inflation    59
dtype: int64

In [207]:
inflation.shape

(62, 1)

### Hundle Nulls

In [208]:
inflation['Inflation'] = inflation.groupby(inflation.index.to_period('M'))['Inflation'].transform('first')

In [209]:
inflation.head(5)

            Inflation
Date
2024-11-01    3.22607
2024-11-02    3.22607
2024-11-03    3.22607
2024-11-04    3.22607
2024-11-05    3.22607

In [210]:
inflation.isnull().sum()

Inflation    0
dtype: int64

In [211]:
inflation.shape

(62, 1)

In [212]:
inflation.tail(5)

            Inflation
Date
2024-12-28   3.234511
2024-12-29   3.234511
2024-12-30   3.234511
2024-12-31   3.234511
2025-01-01   3.930193

In [213]:
inflation = inflation.asfreq('b')

In [214]:
inflation.shape

(44, 1)

In [215]:
inflation.tail(5)

            Inflation
Date
2024-12-26   3.234511
2024-12-27   3.234511
2024-12-30   3.234511
2024-12-31   3.234511
2025-01-01   3.930193

In [216]:
inflation.head()

            Inflation
Date
2024-11-01    3.22607
2024-11-04    3.22607
2024-11-05    3.22607
2024-11-06    3.22607
2024-11-07    3.22607

In [217]:
last_date = inflation.index[-1]  # 2025-01-01
last_value = inflation.iloc[-1]  # آخر قيمة

# إنشاء نطاق تواريخ جديد من آخر تاريخ إلى 2025-01-31
new_dates = pd.date_range(start=last_date + pd.Timedelta(days=1), end="2025-01-31", freq="b")

# إنشاء DataFrame جديد بنفس آخر قيمة
new_df = pd.DataFrame([last_value] * len(new_dates), index=new_dates, columns=inflation.columns)

# دمج البيانات الأصلية مع البيانات الجديدة
inflation = pd.concat([inflation, new_df])

inflation.shape

(66, 1)

In [219]:
inflation.tail()

            Inflation
2025-01-27   3.930193
2025-01-28   3.930193
2025-01-29   3.930193
2025-01-30   3.930193
2025-01-31   3.930193

### Correct The ranges

In [158]:
start_date = '2000-08-01'
end_date = '2000-08-29'

In [159]:
inflation = inflation[~((inflation.index >= start_date) & (inflation.index <= end_date))]

In [160]:
inflation.head()

            Inflation
Date
2000-08-30   2.875701
2000-08-31   2.875701
2000-09-01   3.068734
2000-09-04   3.068734
2000-09-05   3.068734

In [161]:
inflation.shape

(6285, 1)

In [162]:
inflation.tail()

            Inflation
Date
2024-09-25   4.146461
2024-09-26   4.146461
2024-09-27   4.146461
2024-09-30   4.146461
2024-10-01   3.607369

In [163]:
date_range = pd.date_range(start = '2024-10-02' , end = '2024-10-31' , freq = 'b')

In [164]:
date_range

DatetimeIndex(['2024-10-02', '2024-10-03', '2024-10-04', '2024-10-07',
               '2024-10-08', '2024-10-09', '2024-10-10', '2024-10-11',
               '2024-10-14', '2024-10-15', '2024-10-16', '2024-10-17',
               '2024-10-18', '2024-10-21', '2024-10-22', '2024-10-23',
               '2024-10-24', '2024-10-25', '2024-10-28', '2024-10-29',
               '2024-10-30', '2024-10-31'],
              dtype='datetime64[ns]', freq='B')

In [165]:
date_range_df = pd.DataFrame(index = date_range)

In [166]:
date_range_df["Inflation"] = 3.607369

In [167]:
date_range_df

            Inflation
2024-10-02   3.607369
2024-10-03   3.607369
2024-10-04   3.607369
2024-10-07   3.607369
2024-10-08   3.607369
2024-10-09   3.607369
2024-10-10   3.607369
2024-10-11   3.607369
2024-10-14   3.607369
2024-10-15   3.607369
2024-10-16   3.607369
2024-10-17   3.607369
2024-10-18   3.607369
2024-10-21   3.607369
2024-10-22   3.607369
2024-10-23   3.607369
2024-10-24   3.607369
2024-10-25   3.607369
2024-10-28   3.607369
2024-10-29   3.607369
2024-10-30   3.607369
2024-10-31   3.607369

In [168]:
inflation = pd.concat([inflation , date_range_df] , axis = 'rows')

In [169]:
inflation.tail(30)

            Inflation
2024-09-20   4.146461
2024-09-23   4.146461
2024-09-24   4.146461
2024-09-25   4.146461
2024-09-26   4.146461
2024-09-27   4.146461
2024-09-30   4.146461
2024-10-01   3.607369
2024-10-02   3.607369
2024-10-03   3.607369
2024-10-04   3.607369
2024-10-07   3.607369
2024-10-08   3.607369
2024-10-09   3.607369
2024-10-10   3.607369
2024-10-11   3.607369
2024-10-14   3.607369
2024-10-15   3.607369
2024-10-16   3.607369
2024-10-17   3.607369
2024-10-18   3.607369
2024-10-21   3.607369
2024-10-22   3.607369
2024-10-23   3.607369
2024-10-24   3.607369
2024-10-25   3.607369
2024-10-28   3.607369
2024-10-29   3.607369
2024-10-30   3.607369
2024-10-31   3.607369

In [170]:
inflation.shape

(6307, 1)

### Unrate Data

In [220]:
unrate = pd.read_csv("UNRATE_test.csv")

In [221]:
unrate.head()

  observation_date  UNRATE
0       2024-11-01     4.2
1       2024-12-01     4.1
2       2025-01-01     4.0
3       2025-02-01     4.1

In [222]:
unrate = unrate.drop(index = 3)

In [223]:
unrate.shape

(3, 2)

In [224]:
unrate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   observation_date  3 non-null      object
 1   UNRATE            3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

#### Correct Date Format

In [225]:
unrate["observation_date"] = pd.to_datetime(unrate["observation_date"] , format = '%Y-%m-%d')

In [226]:
unrate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   observation_date  3 non-null      datetime64[ns]
 1   UNRATE            3 non-null      float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 180.0 bytes

In [227]:
unrate.head()

  observation_date  UNRATE
0       2024-11-01     4.2
1       2024-12-01     4.1
2       2025-01-01     4.0

### Column Rename

In [228]:
unrate = unrate.rename(columns = {"UNRATE" : "Unrate" , "observation_date" : "Date"})

In [229]:
unrate.head()

        Date  Unrate
0 2024-11-01     4.2
1 2024-12-01     4.1
2 2025-01-01     4.0

### Set Date Index

In [230]:
unrate = unrate.set_index("Date")

In [231]:
unrate.head()

            Unrate
Date
2024-11-01     4.2
2024-12-01     4.1
2025-01-01     4.0

### Set Frequency

In [232]:
unrate = unrate.asfreq('d')

In [233]:
unrate.head()

            Unrate
Date
2024-11-01     4.2
2024-11-02     NaN
2024-11-03     NaN
2024-11-04     NaN
2024-11-05     NaN

In [234]:
unrate.isnull().sum()

Unrate    59
dtype: int64

In [235]:
unrate.shape

(62, 1)

### Hundle Nulls

In [236]:
unrate['Unrate'] = unrate.groupby(unrate.index.to_period('M'))['Unrate'].transform('first')

In [237]:
unrate.head(5)

            Unrate
Date
2024-11-01     4.2
2024-11-02     4.2
2024-11-03     4.2
2024-11-04     4.2
2024-11-05     4.2

In [238]:
unrate.isnull().sum()

Unrate    0
dtype: int64

In [239]:
unrate.shape

(62, 1)

In [240]:
unrate.tail(5)

            Unrate
Date
2024-12-28     4.1
2024-12-29     4.1
2024-12-30     4.1
2024-12-31     4.1
2025-01-01     4.0

In [241]:
unrate = unrate.asfreq('b')

In [242]:
unrate.shape

(44, 1)

In [243]:
unrate.tail(5)

            Unrate
Date
2024-12-26     4.1
2024-12-27     4.1
2024-12-30     4.1
2024-12-31     4.1
2025-01-01     4.0

In [244]:
unrate.head()

            Unrate
Date
2024-11-01     4.2
2024-11-04     4.2
2024-11-05     4.2
2024-11-06     4.2
2024-11-07     4.2

In [245]:
last_date = unrate.index[-1]  # 2025-01-01
last_value = unrate.iloc[-1]  # آخر قيمة

# إنشاء نطاق تواريخ جديد من آخر تاريخ إلى 2025-01-31
new_dates = pd.date_range(start=last_date + pd.Timedelta(days=1), end="2025-01-31", freq="b")

# إنشاء DataFrame جديد بنفس آخر قيمة
new_df = pd.DataFrame([last_value] * len(new_dates), index=new_dates, columns=unrate.columns)

# دمج البيانات الأصلية مع البيانات الجديدة
unrate = pd.concat([unrate, new_df])

unrate.shape

(66, 1)

In [246]:
unrate.tail()

            Unrate
2025-01-27     4.0
2025-01-28     4.0
2025-01-29     4.0
2025-01-30     4.0
2025-01-31     4.0

### Correct The ranges

In [193]:
start_date = '2000-08-01'
end_date = '2000-08-29'

In [196]:
unrate = unrate[~((unrate.index >= start_date) & (unrate.index <= end_date))]

In [197]:
unrate.head()

            Unrate
Date
2000-08-30     4.1
2000-08-31     4.1
2000-09-01     3.9
2000-09-04     3.9
2000-09-05     3.9

In [198]:
unrate.shape

(6285, 1)

In [199]:
unrate.tail()

            Unrate
Date
2024-09-25     4.1
2024-09-26     4.1
2024-09-27     4.1
2024-09-30     4.1
2024-10-01     4.1

In [200]:
date_range = pd.date_range(start = '2024-10-02' , end = '2024-10-31' , freq = 'b')

In [201]:
date_range

DatetimeIndex(['2024-10-02', '2024-10-03', '2024-10-04', '2024-10-07',
               '2024-10-08', '2024-10-09', '2024-10-10', '2024-10-11',
               '2024-10-14', '2024-10-15', '2024-10-16', '2024-10-17',
               '2024-10-18', '2024-10-21', '2024-10-22', '2024-10-23',
               '2024-10-24', '2024-10-25', '2024-10-28', '2024-10-29',
               '2024-10-30', '2024-10-31'],
              dtype='datetime64[ns]', freq='B')

In [202]:
date_range_df = pd.DataFrame(index = date_range)

In [203]:
date_range_df["Unrate"] = 4.1

In [204]:
date_range_df

            Unrate
2024-10-02     4.1
2024-10-03     4.1
2024-10-04     4.1
2024-10-07     4.1
2024-10-08     4.1
2024-10-09     4.1
2024-10-10     4.1
2024-10-11     4.1
2024-10-14     4.1
2024-10-15     4.1
2024-10-16     4.1
2024-10-17     4.1
2024-10-18     4.1
2024-10-21     4.1
2024-10-22     4.1
2024-10-23     4.1
2024-10-24     4.1
2024-10-25     4.1
2024-10-28     4.1
2024-10-29     4.1
2024-10-30     4.1
2024-10-31     4.1

In [205]:
unrate = pd.concat([unrate , date_range_df] , axis = 'rows')

In [206]:
unrate.tail(30)

            Unrate
2024-09-20     4.1
2024-09-23     4.1
2024-09-24     4.1
2024-09-25     4.1
2024-09-26     4.1
2024-09-27     4.1
2024-09-30     4.1
2024-10-01     4.1
2024-10-02     4.1
2024-10-03     4.1
2024-10-04     4.1
2024-10-07     4.1
2024-10-08     4.1
2024-10-09     4.1
2024-10-10     4.1
2024-10-11     4.1
2024-10-14     4.1
2024-10-15     4.1
2024-10-16     4.1
2024-10-17     4.1
2024-10-18     4.1
2024-10-21     4.1
2024-10-22     4.1
2024-10-23     4.1
2024-10-24     4.1
2024-10-25     4.1
2024-10-28     4.1
2024-10-29     4.1
2024-10-30     4.1
2024-10-31     4.1

In [207]:
unrate.shape

(6307, 1)

### Combine In One DataFrame

In [247]:
monthly_prices = pd.concat([interest , inflation , unrate] , axis = 'columns')

In [248]:
monthly_prices.head()

            Interest  Inflation  Unrate
2024-11-01  1.958417    3.22607     4.2
2024-11-04  1.958417    3.22607     4.2
2024-11-05  1.958417    3.22607     4.2
2024-11-06  1.958417    3.22607     4.2
2024-11-07  1.958417    3.22607     4.2

In [249]:
monthly_prices.tail()

            Interest  Inflation  Unrate
2025-01-27  2.055532   3.930193     4.0
2025-01-28  2.055532   3.930193     4.0
2025-01-29  2.055532   3.930193     4.0
2025-01-30  2.055532   3.930193     4.0
2025-01-31  2.055532   3.930193     4.0

In [250]:
monthly_prices.shape

(66, 3)

# Combine The Daily And Monthly Data

In [251]:
all_prices = pd.concat([prices , monthly_prices] , axis = 'columns')

In [252]:
all_prices.head()

,Gold,Silver,Oil,US Dollar,S&P 500,Interest,Inflation,Unrate
2024-11-01,2738.6,32.54,69.49,104.28,5728.80,1.958417,3.22607,4.2
2024-11-04,2736.1,32.48,71.47,103.89,5712.69,1.958417,3.22607,4.2
2024-11-05,2740.3,32.65,71.99,103.42,5782.76,1.958417,3.22607,4.2
2024-11-06,2667.6,31.22,71.69,105.09,5929.04,1.958417,3.22607,4.2
2024-11-07,2698.4,31.76,72.36,104.51,5973.10,1.958417,3.22607,4.2

In [253]:
all_prices.tail()

,Gold,Silver,Oil,US Dollar,S&P 500,Interest,Inflation,Unrate
2025-01-27,2737.5,30.25,73.17,107.34,6012.28,2.055532,3.930193,4.0
2025-01-28,2766.8,30.73,73.77,107.87,6067.70,2.055532,3.930193,4.0
2025-01-29,2769.1,31.24,72.62,108.00,6039.31,2.055532,3.930193,4.0
2025-01-30,2823.0,32.36,72.73,107.80,6071.17,2.055532,3.930193,4.0
2025-01-31,2812.5,32.13,72.53,108.37,6040.53,2.055532,3.930193,4.0

In [254]:
all_prices.shape

(66, 8)

In [255]:
all_prices.isnull().sum()

Gold         0
Silver       0
Oil          0
US Dollar    0
S&P 500      0
Interest     0
Inflation    0
Unrate       0
dtype: int64

# Save Processed Data

In [256]:
all_prices.to_csv("Processed_Data_test.csv" , index = True)